MikroElektronika/core_packages/PIC/XC8/def/PIC12F635/mcu.h
// Register: T1CON
#define T1CON T1CON
extern volatile unsigned char           T1CON               __at(0x010);
#ifndef _LIB_BUILD
asm("T1CON equ 010h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1ON                 :1;
        unsigned TMR1CS                 :1;
        unsigned nT1SYNC                :1;
        unsigned T1OSCEN                :1;
        unsigned T1CKPS                 :2;
        unsigned TMR1GE                 :1;
        unsigned T1GINV                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned T1CKPS0                :1;
        unsigned T1CKPS1                :1;
    };
} T1CONbits_t;
extern volatile T1CONbits_t T1CONbits __at(0x010);
// bitfield macros
#define _T1CON_TMR1ON_POSN                                  0x0
#define _T1CON_TMR1ON_POSITION                              0x0
#define _T1CON_TMR1ON_SIZE                                  0x1
#define _T1CON_TMR1ON_LENGTH                                0x1
#define _T1CON_TMR1ON_MASK                                  0x1
#define _T1CON_TMR1CS_POSN                                  0x1
#define _T1CON_TMR1CS_POSITION                              0x1
#define _T1CON_TMR1CS_SIZE                                  0x1
#define _T1CON_TMR1CS_LENGTH                                0x1
#define _T1CON_TMR1CS_MASK                                  0x2
#define _T1CON_nT1SYNC_POSN                                 0x2
#define _T1CON_nT1SYNC_POSITION                             0x2
#define _T1CON_nT1SYNC_SIZE                                 0x1
#define _T1CON_nT1SYNC_LENGTH                               0x1
#define _T1CON_nT1SYNC_MASK                                 0x4
#define _T1CON_T1OSCEN_POSN                                 0x3
#define _T1CON_T1OSCEN_POSITION                             0x3
#define _T1CON_T1OSCEN_SIZE                                 0x1
#define _T1CON_T1OSCEN_LENGTH                               0x1
#define _T1CON_T1OSCEN_MASK                                 0x8
#define _T1CON_T1CKPS_POSN                                  0x4
#define _T1CON_T1CKPS_POSITION                              0x4
#define _T1CON_T1CKPS_SIZE                                  0x2
#define _T1CON_T1CKPS_LENGTH                                0x2
#define _T1CON_T1CKPS_MASK                                  0x30
#define _T1CON_TMR1GE_POSN                                  0x6
#define _T1CON_TMR1GE_POSITION                              0x6
#define _T1CON_TMR1GE_SIZE                                  0x1
#define _T1CON_TMR1GE_LENGTH                                0x1
#define _T1CON_TMR1GE_MASK                                  0x40
#define _T1CON_T1GINV_POSN                                  0x7
#define _T1CON_T1GINV_POSITION                              0x7
#define _T1CON_T1GINV_SIZE                                  0x1
#define _T1CON_T1GINV_LENGTH                                0x1
#define _T1CON_T1GINV_MASK                                  0x80
#define _T1CON_T1CKPS0_POSN                                 0x4
#define _T1CON_T1CKPS0_POSITION                             0x4
#define _T1CON_T1CKPS0_SIZE                                 0x1
#define _T1CON_T1CKPS0_LENGTH                               0x1
#define _T1CON_T1CKPS0_MASK                                 0x10
#define _T1CON_T1CKPS1_POSN                                 0x5
#define _T1CON_T1CKPS1_POSITION                             0x5
#define _T1CON_T1CKPS1_SIZE                                 0x1
#define _T1CON_T1CKPS1_LENGTH                               0x1
#define _T1CON_T1CKPS1_MASK                                 0x20

// Register: WDTCON
#define WDTCON WDTCON
extern volatile unsigned char           WDTCON              __at(0x018);
#ifndef _LIB_BUILD
asm("WDTCON equ 018h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWDTEN                 :1;
        unsigned WDTPS                  :4;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
    };
} WDTCONbits_t;
extern volatile WDTCONbits_t WDTCONbits __at(0x018);
// bitfield macros
#define _WDTCON_SWDTEN_POSN                                 0x0
#define _WDTCON_SWDTEN_POSITION                             0x0
#define _WDTCON_SWDTEN_SIZE                                 0x1
#define _WDTCON_SWDTEN_LENGTH                               0x1
#define _WDTCON_SWDTEN_MASK                                 0x1
#define _WDTCON_WDTPS_POSN                                  0x1
#define _WDTCON_WDTPS_POSITION                              0x1
#define _WDTCON_WDTPS_SIZE                                  0x4
#define _WDTCON_WDTPS_LENGTH                                0x4
#define _WDTCON_WDTPS_MASK                                  0x1E
#define _WDTCON_WDTPS0_POSN                                 0x1
#define _WDTCON_WDTPS0_POSITION                             0x1
#define _WDTCON_WDTPS0_SIZE                                 0x1
#define _WDTCON_WDTPS0_LENGTH                               0x1
#define _WDTCON_WDTPS0_MASK                                 0x2
#define _WDTCON_WDTPS1_POSN                                 0x2
#define _WDTCON_WDTPS1_POSITION                             0x2
#define _WDTCON_WDTPS1_SIZE                                 0x1
#define _WDTCON_WDTPS1_LENGTH                               0x1
#define _WDTCON_WDTPS1_MASK                                 0x4
#define _WDTCON_WDTPS2_POSN                                 0x3
#define _WDTCON_WDTPS2_POSITION                             0x3
#define _WDTCON_WDTPS2_SIZE                                 0x1
#define _WDTCON_WDTPS2_LENGTH                               0x1
#define _WDTCON_WDTPS2_MASK                                 0x8
#define _WDTCON_WDTPS3_POSN                                 0x4
#define _WDTCON_WDTPS3_POSITION                             0x4
#define _WDTCON_WDTPS3_SIZE                                 0x1
#define _WDTCON_WDTPS3_LENGTH                               0x1
#define _WDTCON_WDTPS3_MASK                                 0x10

// Register: CMCON0
#define CMCON0 CMCON0
extern volatile unsigned char           CMCON0              __at(0x019);
#ifndef _LIB_BUILD
asm("CMCON0 equ 019h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM                     :3;
        unsigned CIS                    :1;
        unsigned CINV                   :1;
        unsigned                        :1;
        unsigned COUT                   :1;
    };
    struct {
        unsigned CM0                    :1;
        unsigned CM1                    :1;
        unsigned CM2                    :1;
        unsigned                        :3;
        unsigned C1OUT                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned C1INV                  :1;
    };
} CMCON0bits_t;
extern volatile CMCON0bits_t CMCON0bits __at(0x019);
// bitfield macros
#define _CMCON0_CM_POSN                                     0x0
#define _CMCON0_CM_POSITION                                 0x0
#define _CMCON0_CM_SIZE                                     0x3
#define _CMCON0_CM_LENGTH                                   0x3
#define _CMCON0_CM_MASK                                     0x7
#define _CMCON0_CIS_POSN                                    0x3
#define _CMCON0_CIS_POSITION                                0x3
#define _CMCON0_CIS_SIZE                                    0x1
#define _CMCON0_CIS_LENGTH                                  0x1
#define _CMCON0_CIS_MASK                                    0x8
#define _CMCON0_CINV_POSN                                   0x4
#define _CMCON0_CINV_POSITION                               0x4
#define _CMCON0_CINV_SIZE                                   0x1
#define _CMCON0_CINV_LENGTH                                 0x1
#define _CMCON0_CINV_MASK                                   0x10
#define _CMCON0_COUT_POSN                                   0x6
#define _CMCON0_COUT_POSITION                               0x6
#define _CMCON0_COUT_SIZE                                   0x1
#define _CMCON0_COUT_LENGTH                                 0x1
#define _CMCON0_COUT_MASK                                   0x40
#define _CMCON0_CM0_POSN                                    0x0
#define _CMCON0_CM0_POSITION                                0x0
#define _CMCON0_CM0_SIZE                                    0x1
#define _CMCON0_CM0_LENGTH                                  0x1
#define _CMCON0_CM0_MASK                                    0x1
#define _CMCON0_CM1_POSN                                    0x1
#define _CMCON0_CM1_POSITION                                0x1
#define _CMCON0_CM1_SIZE                                    0x1
#define _CMCON0_CM1_LENGTH                                  0x1
#define _CMCON0_CM1_MASK                                    0x2
#define _CMCON0_CM2_POSN                                    0x2
#define _CMCON0_CM2_POSITION                                0x2
#define _CMCON0_CM2_SIZE                                    0x1
#define _CMCON0_CM2_LENGTH                                  0x1
#define _CMCON0_CM2_MASK                                    0x4
#define _CMCON0_C1OUT_POSN                                  0x6
#define _CMCON0_C1OUT_POSITION                              0x6
#define _CMCON0_C1OUT_SIZE                                  0x1
#define _CMCON0_C1OUT_LENGTH                                0x1
#define _CMCON0_C1OUT_MASK                                  0x40
#define _CMCON0_C1INV_POSN                                  0x4
#define _CMCON0_C1INV_POSITION                              0x4
#define _CMCON0_C1INV_SIZE                                  0x1
#define _CMCON0_C1INV_LENGTH                                0x1
#define _CMCON0_C1INV_MASK                                  0x10

// Register: CMCON1
#define CMCON1 CMCON1
extern volatile unsigned char           CMCON1              __at(0x01A);
#ifndef _LIB_BUILD
asm("CMCON1 equ 01Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMSYNC                 :1;
        unsigned T1GSS                  :1;
    };
    struct {
        unsigned C1SYNC                 :1;
    };
} CMCON1bits_t;
extern volatile CMCON1bits_t CMCON1bits __at(0x01A);
// bitfield macros
#define _CMCON1_CMSYNC_POSN                                 0x0
#define _CMCON1_CMSYNC_POSITION                             0x0
#define _CMCON1_CMSYNC_SIZE                                 0x1
#define _CMCON1_CMSYNC_LENGTH                               0x1
#define _CMCON1_CMSYNC_MASK                                 0x1
#define _CMCON1_T1GSS_POSN                                  0x1
#define _CMCON1_T1GSS_POSITION                              0x1
#define _CMCON1_T1GSS_SIZE                                  0x1
#define _CMCON1_T1GSS_LENGTH                                0x1
#define _CMCON1_T1GSS_MASK                                  0x2
#define _CMCON1_C1SYNC_POSN                                 0x0
#define _CMCON1_C1SYNC_POSITION                             0x0
#define _CMCON1_C1SYNC_SIZE                                 0x1
#define _CMCON1_C1SYNC_LENGTH                               0x1
#define _CMCON1_C1SYNC_MASK                                 0x1

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
extern volatile unsigned char           OPTION_REG          __at(0x081);
#ifndef _LIB_BUILD
asm("OPTION_REG equ 081h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :3;
        unsigned PSA                    :1;
        unsigned T0SE                   :1;
        unsigned T0CS                   :1;
        unsigned INTEDG                 :1;
        unsigned nRAPU                  :1;
    };
    struct {
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} OPTION_REGbits_t;
extern volatile OPTION_REGbits_t OPTION_REGbits __at(0x081);
// bitfield macros
#define _OPTION_REG_PS_POSN                                 0x0
#define _OPTION_REG_PS_POSITION                             0x0
#define _OPTION_REG_PS_SIZE                                 0x3
#define _OPTION_REG_PS_LENGTH                               0x3
#define _OPTION_REG_PS_MASK                                 0x7
#define _OPTION_REG_PSA_POSN                                0x3
#define _OPTION_REG_PSA_POSITION                            0x3
#define _OPTION_REG_PSA_SIZE                                0x1
#define _OPTION_REG_PSA_LENGTH                              0x1
#define _OPTION_REG_PSA_MASK                                0x8
#define _OPTION_REG_T0SE_POSN                               0x4
#define _OPTION_REG_T0SE_POSITION                           0x4
#define _OPTION_REG_T0SE_SIZE                               0x1
#define _OPTION_REG_T0SE_LENGTH                             0x1
#define _OPTION_REG_T0SE_MASK                               0x10
#define _OPTION_REG_T0CS_POSN                               0x5
#define _OPTION_REG_T0CS_POSITION                           0x5
#define _OPTION_REG_T0CS_SIZE                               0x1
#define _OPTION_REG_T0CS_LENGTH                             0x1
#define _OPTION_REG_T0CS_MASK                               0x20
#define _OPTION_REG_INTEDG_POSN                             0x6
#define _OPTION_REG_INTEDG_POSITION                         0x6
#define _OPTION_REG_INTEDG_SIZE                             0x1
#define _OPTION_REG_INTEDG_LENGTH                           0x1
#define _OPTION_REG_INTEDG_MASK                             0x40
#define _OPTION_REG_nRAPU_POSN                              0x7
#define _OPTION_REG_nRAPU_POSITION                          0x7
#define _OPTION_REG_nRAPU_SIZE                              0x1
#define _OPTION_REG_nRAPU_LENGTH                            0x1
#define _OPTION_REG_nRAPU_MASK                              0x80
#define _OPTION_REG_PS0_POSN                                0x0
#define _OPTION_REG_PS0_POSITION                            0x0
#define _OPTION_REG_PS0_SIZE                                0x1
#define _OPTION_REG_PS0_LENGTH                              0x1
#define _OPTION_REG_PS0_MASK                                0x1
#define _OPTION_REG_PS1_POSN                                0x1
#define _OPTION_REG_PS1_POSITION                            0x1
#define _OPTION_REG_PS1_SIZE                                0x1
#define _OPTION_REG_PS1_LENGTH                              0x1
#define _OPTION_REG_PS1_MASK                                0x2
#define _OPTION_REG_PS2_POSN                                0x2
#define _OPTION_REG_PS2_POSITION                            0x2
#define _OPTION_REG_PS2_SIZE                                0x1
#define _OPTION_REG_PS2_LENGTH                              0x1
#define _OPTION_REG_PS2_MASK                                0x4

// Register: TRISIO
#define TRISIO TRISIO
extern volatile unsigned char           TRISIO              __at(0x085);
#ifndef _LIB_BUILD
asm("TRISIO equ 085h");
#endif
// aliases
extern volatile unsigned char           TRISA               __at(0x085);
#ifndef _LIB_BUILD
asm("TRISA equ 085h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISIO0                :1;
        unsigned TRISIO1                :1;
        unsigned TRISIO2                :1;
        unsigned TRISIO3                :1;
        unsigned TRISIO4                :1;
        unsigned TRISIO5                :1;
    };
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned TRISA4                 :1;
        unsigned TRISA5                 :1;
    };
} TRISIObits_t;
extern volatile TRISIObits_t TRISIObits __at(0x085);
// bitfield macros
#define _TRISIO_TRISIO0_POSN                                0x0
#define _TRISIO_TRISIO0_POSITION                            0x0
#define _TRISIO_TRISIO0_SIZE                                0x1
#define _TRISIO_TRISIO0_LENGTH                              0x1
#define _TRISIO_TRISIO0_MASK                                0x1
#define _TRISIO_TRISIO1_POSN                                0x1
#define _TRISIO_TRISIO1_POSITION                            0x1
#define _TRISIO_TRISIO1_SIZE                                0x1
#define _TRISIO_TRISIO1_LENGTH                              0x1
#define _TRISIO_TRISIO1_MASK                                0x2
#define _TRISIO_TRISIO2_POSN                                0x2
#define _TRISIO_TRISIO2_POSITION                            0x2
#define _TRISIO_TRISIO2_SIZE                                0x1
#define _TRISIO_TRISIO2_LENGTH                              0x1
#define _TRISIO_TRISIO2_MASK                                0x4
#define _TRISIO_TRISIO3_POSN                                0x3
#define _TRISIO_TRISIO3_POSITION                            0x3
#define _TRISIO_TRISIO3_SIZE                                0x1
#define _TRISIO_TRISIO3_LENGTH                              0x1
#define _TRISIO_TRISIO3_MASK                                0x8
#define _TRISIO_TRISIO4_POSN                                0x4
#define _TRISIO_TRISIO4_POSITION                            0x4
#define _TRISIO_TRISIO4_SIZE                                0x1
#define _TRISIO_TRISIO4_LENGTH                              0x1
#define _TRISIO_TRISIO4_MASK                                0x10
#define _TRISIO_TRISIO5_POSN                                0x5
#define _TRISIO_TRISIO5_POSITION                            0x5
#define _TRISIO_TRISIO5_SIZE                                0x1
#define _TRISIO_TRISIO5_LENGTH                              0x1
#define _TRISIO_TRISIO5_MASK                                0x20
#define _TRISIO_TRISA0_POSN                                 0x0
#define _TRISIO_TRISA0_POSITION                             0x0
#define _TRISIO_TRISA0_SIZE                                 0x1
#define _TRISIO_TRISA0_LENGTH                               0x1
#define _TRISIO_TRISA0_MASK                                 0x1
#define _TRISIO_TRISA1_POSN                                 0x1
#define _TRISIO_TRISA1_POSITION                             0x1
#define _TRISIO_TRISA1_SIZE                                 0x1
#define _TRISIO_TRISA1_LENGTH                               0x1
#define _TRISIO_TRISA1_MASK                                 0x2
#define _TRISIO_TRISA2_POSN                                 0x2
#define _TRISIO_TRISA2_POSITION                             0x2
#define _TRISIO_TRISA2_SIZE                                 0x1
#define _TRISIO_TRISA2_LENGTH                               0x1
#define _TRISIO_TRISA2_MASK                                 0x4
#define _TRISIO_TRISA3_POSN                                 0x3
#define _TRISIO_TRISA3_POSITION                             0x3
#define _TRISIO_TRISA3_SIZE                                 0x1
#define _TRISIO_TRISA3_LENGTH                               0x1
#define _TRISIO_TRISA3_MASK                                 0x8
#define _TRISIO_TRISA4_POSN                                 0x4
#define _TRISIO_TRISA4_POSITION                             0x4
#define _TRISIO_TRISA4_SIZE                                 0x1
#define _TRISIO_TRISA4_LENGTH                               0x1
#define _TRISIO_TRISA4_MASK                                 0x10
#define _TRISIO_TRISA5_POSN                                 0x5
#define _TRISIO_TRISA5_POSITION                             0x5
#define _TRISIO_TRISA5_SIZE                                 0x1
#define _TRISIO_TRISA5_LENGTH                               0x1
#define _TRISIO_TRISA5_MASK                                 0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned TRISIO0                :1;
        unsigned TRISIO1                :1;
        unsigned TRISIO2                :1;
        unsigned TRISIO3                :1;
        unsigned TRISIO4                :1;
        unsigned TRISIO5                :1;
    };
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned TRISA4                 :1;
        unsigned TRISA5                 :1;
    };
} TRISAbits_t;
