MikroElektronika/core_packages/PIC/XC8/def/PIC12F635/mcu.h
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x090);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :5;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0x090);
// bitfield macros
#define _OSCTUNE_TUN_POSN                                   0x0
#define _OSCTUNE_TUN_POSITION                               0x0
#define _OSCTUNE_TUN_SIZE                                   0x5
#define _OSCTUNE_TUN_LENGTH                                 0x5
#define _OSCTUNE_TUN_MASK                                   0x1F
#define _OSCTUNE_TUN0_POSN                                  0x0
#define _OSCTUNE_TUN0_POSITION                              0x0
#define _OSCTUNE_TUN0_SIZE                                  0x1
#define _OSCTUNE_TUN0_LENGTH                                0x1
#define _OSCTUNE_TUN0_MASK                                  0x1
#define _OSCTUNE_TUN1_POSN                                  0x1
#define _OSCTUNE_TUN1_POSITION                              0x1
#define _OSCTUNE_TUN1_SIZE                                  0x1
#define _OSCTUNE_TUN1_LENGTH                                0x1
#define _OSCTUNE_TUN1_MASK                                  0x2
#define _OSCTUNE_TUN2_POSN                                  0x2
#define _OSCTUNE_TUN2_POSITION                              0x2
#define _OSCTUNE_TUN2_SIZE                                  0x1
#define _OSCTUNE_TUN2_LENGTH                                0x1
#define _OSCTUNE_TUN2_MASK                                  0x4
#define _OSCTUNE_TUN3_POSN                                  0x3
#define _OSCTUNE_TUN3_POSITION                              0x3
#define _OSCTUNE_TUN3_SIZE                                  0x1
#define _OSCTUNE_TUN3_LENGTH                                0x1
#define _OSCTUNE_TUN3_MASK                                  0x8
#define _OSCTUNE_TUN4_POSN                                  0x4
#define _OSCTUNE_TUN4_POSITION                              0x4
#define _OSCTUNE_TUN4_SIZE                                  0x1
#define _OSCTUNE_TUN4_LENGTH                                0x1
#define _OSCTUNE_TUN4_MASK                                  0x10

// Register: LVDCON
#define LVDCON LVDCON
extern volatile unsigned char           LVDCON              __at(0x094);
#ifndef _LIB_BUILD
asm("LVDCON equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LVDL                   :3;
        unsigned                        :1;
        unsigned LVDEN                  :1;
        unsigned IRVST                  :1;
    };
    struct {
        unsigned LVDL0                  :1;
        unsigned LVDL1                  :1;
        unsigned LVDL2                  :1;
        unsigned                        :1;
        unsigned PLVDEN                 :1;
    };
} LVDCONbits_t;
extern volatile LVDCONbits_t LVDCONbits __at(0x094);
// bitfield macros
#define _LVDCON_LVDL_POSN                                   0x0
#define _LVDCON_LVDL_POSITION                               0x0
#define _LVDCON_LVDL_SIZE                                   0x3
#define _LVDCON_LVDL_LENGTH                                 0x3
#define _LVDCON_LVDL_MASK                                   0x7
#define _LVDCON_LVDEN_POSN                                  0x4
#define _LVDCON_LVDEN_POSITION                              0x4
#define _LVDCON_LVDEN_SIZE                                  0x1
#define _LVDCON_LVDEN_LENGTH                                0x1
#define _LVDCON_LVDEN_MASK                                  0x10
#define _LVDCON_IRVST_POSN                                  0x5
#define _LVDCON_IRVST_POSITION                              0x5
#define _LVDCON_IRVST_SIZE                                  0x1
#define _LVDCON_IRVST_LENGTH                                0x1
#define _LVDCON_IRVST_MASK                                  0x20
#define _LVDCON_LVDL0_POSN                                  0x0
#define _LVDCON_LVDL0_POSITION                              0x0
#define _LVDCON_LVDL0_SIZE                                  0x1
#define _LVDCON_LVDL0_LENGTH                                0x1
#define _LVDCON_LVDL0_MASK                                  0x1
#define _LVDCON_LVDL1_POSN                                  0x1
#define _LVDCON_LVDL1_POSITION                              0x1
#define _LVDCON_LVDL1_SIZE                                  0x1
#define _LVDCON_LVDL1_LENGTH                                0x1
#define _LVDCON_LVDL1_MASK                                  0x2
#define _LVDCON_LVDL2_POSN                                  0x2
#define _LVDCON_LVDL2_POSITION                              0x2
#define _LVDCON_LVDL2_SIZE                                  0x1
#define _LVDCON_LVDL2_LENGTH                                0x1
#define _LVDCON_LVDL2_MASK                                  0x4
#define _LVDCON_PLVDEN_POSN                                 0x4
#define _LVDCON_PLVDEN_POSITION                             0x4
#define _LVDCON_PLVDEN_SIZE                                 0x1
#define _LVDCON_PLVDEN_LENGTH                               0x1
#define _LVDCON_PLVDEN_MASK                                 0x10

// Register: WPUDA
#define WPUDA WPUDA
extern volatile unsigned char           WPUDA               __at(0x095);
#ifndef _LIB_BUILD
asm("WPUDA equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUDA0                 :1;
        unsigned WPUDA1                 :1;
        unsigned WPUDA2                 :1;
        unsigned                        :1;
        unsigned WPUDA4                 :1;
        unsigned WPUDA5                 :1;
    };
} WPUDAbits_t;
extern volatile WPUDAbits_t WPUDAbits __at(0x095);
// bitfield macros
#define _WPUDA_WPUDA0_POSN                                  0x0
#define _WPUDA_WPUDA0_POSITION                              0x0
#define _WPUDA_WPUDA0_SIZE                                  0x1
#define _WPUDA_WPUDA0_LENGTH                                0x1
#define _WPUDA_WPUDA0_MASK                                  0x1
#define _WPUDA_WPUDA1_POSN                                  0x1
#define _WPUDA_WPUDA1_POSITION                              0x1
#define _WPUDA_WPUDA1_SIZE                                  0x1
#define _WPUDA_WPUDA1_LENGTH                                0x1
#define _WPUDA_WPUDA1_MASK                                  0x2
#define _WPUDA_WPUDA2_POSN                                  0x2
#define _WPUDA_WPUDA2_POSITION                              0x2
#define _WPUDA_WPUDA2_SIZE                                  0x1
#define _WPUDA_WPUDA2_LENGTH                                0x1
#define _WPUDA_WPUDA2_MASK                                  0x4
#define _WPUDA_WPUDA4_POSN                                  0x4
#define _WPUDA_WPUDA4_POSITION                              0x4
#define _WPUDA_WPUDA4_SIZE                                  0x1
#define _WPUDA_WPUDA4_LENGTH                                0x1
#define _WPUDA_WPUDA4_MASK                                  0x10
#define _WPUDA_WPUDA5_POSN                                  0x5
#define _WPUDA_WPUDA5_POSITION                              0x5
#define _WPUDA_WPUDA5_SIZE                                  0x1
#define _WPUDA_WPUDA5_LENGTH                                0x1
#define _WPUDA_WPUDA5_MASK                                  0x20

// Register: IOCA
#define IOCA IOCA
extern volatile unsigned char           IOCA                __at(0x096);
#ifndef _LIB_BUILD
asm("IOCA equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCA0                  :1;
        unsigned IOCA1                  :1;
        unsigned IOCA2                  :1;
        unsigned IOCA3                  :1;
        unsigned IOCA4                  :1;
        unsigned IOCA5                  :1;
    };
} IOCAbits_t;
extern volatile IOCAbits_t IOCAbits __at(0x096);
// bitfield macros
#define _IOCA_IOCA0_POSN                                    0x0
#define _IOCA_IOCA0_POSITION                                0x0
#define _IOCA_IOCA0_SIZE                                    0x1
#define _IOCA_IOCA0_LENGTH                                  0x1
#define _IOCA_IOCA0_MASK                                    0x1
#define _IOCA_IOCA1_POSN                                    0x1
#define _IOCA_IOCA1_POSITION                                0x1
#define _IOCA_IOCA1_SIZE                                    0x1
#define _IOCA_IOCA1_LENGTH                                  0x1
#define _IOCA_IOCA1_MASK                                    0x2
#define _IOCA_IOCA2_POSN                                    0x2
#define _IOCA_IOCA2_POSITION                                0x2
#define _IOCA_IOCA2_SIZE                                    0x1
#define _IOCA_IOCA2_LENGTH                                  0x1
#define _IOCA_IOCA2_MASK                                    0x4
#define _IOCA_IOCA3_POSN                                    0x3
#define _IOCA_IOCA3_POSITION                                0x3
#define _IOCA_IOCA3_SIZE                                    0x1
#define _IOCA_IOCA3_LENGTH                                  0x1
#define _IOCA_IOCA3_MASK                                    0x8
#define _IOCA_IOCA4_POSN                                    0x4
#define _IOCA_IOCA4_POSITION                                0x4
#define _IOCA_IOCA4_SIZE                                    0x1
#define _IOCA_IOCA4_LENGTH                                  0x1
#define _IOCA_IOCA4_MASK                                    0x10
#define _IOCA_IOCA5_POSN                                    0x5
#define _IOCA_IOCA5_POSITION                                0x5
#define _IOCA_IOCA5_SIZE                                    0x1
#define _IOCA_IOCA5_LENGTH                                  0x1
#define _IOCA_IOCA5_MASK                                    0x20

// Register: WDA
#define WDA WDA
extern volatile unsigned char           WDA                 __at(0x097);
#ifndef _LIB_BUILD
asm("WDA equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WDA0                   :1;
        unsigned WDA1                   :1;
        unsigned WDA2                   :1;
        unsigned                        :1;
        unsigned WDA4                   :1;
        unsigned WDA5                   :1;
    };
} WDAbits_t;
extern volatile WDAbits_t WDAbits __at(0x097);
// bitfield macros
#define _WDA_WDA0_POSN                                      0x0
#define _WDA_WDA0_POSITION                                  0x0
#define _WDA_WDA0_SIZE                                      0x1
#define _WDA_WDA0_LENGTH                                    0x1
#define _WDA_WDA0_MASK                                      0x1
#define _WDA_WDA1_POSN                                      0x1
#define _WDA_WDA1_POSITION                                  0x1
#define _WDA_WDA1_SIZE                                      0x1
#define _WDA_WDA1_LENGTH                                    0x1
#define _WDA_WDA1_MASK                                      0x2
#define _WDA_WDA2_POSN                                      0x2
#define _WDA_WDA2_POSITION                                  0x2
#define _WDA_WDA2_SIZE                                      0x1
#define _WDA_WDA2_LENGTH                                    0x1
#define _WDA_WDA2_MASK                                      0x4
#define _WDA_WDA4_POSN                                      0x4
#define _WDA_WDA4_POSITION                                  0x4
#define _WDA_WDA4_SIZE                                      0x1
#define _WDA_WDA4_LENGTH                                    0x1
#define _WDA_WDA4_MASK                                      0x10
#define _WDA_WDA5_POSN                                      0x5
#define _WDA_WDA5_POSITION                                  0x5
#define _WDA_WDA5_SIZE                                      0x1
#define _WDA_WDA5_LENGTH                                    0x1
#define _WDA_WDA5_MASK                                      0x20

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x099);
#ifndef _LIB_BUILD
asm("VRCON equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned                        :1;
        unsigned VRR                    :1;
        unsigned                        :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
    };
} VRCONbits_t;
