MikroElektronika/core_packages/PIC/XC8/def/PIC12F635/mcu.h
extern volatile VRCONbits_t VRCONbits __at(0x099);
// bitfield macros
#define _VRCON_VR_POSN                                      0x0
#define _VRCON_VR_POSITION                                  0x0
#define _VRCON_VR_SIZE                                      0x4
#define _VRCON_VR_LENGTH                                    0x4
#define _VRCON_VR_MASK                                      0xF
#define _VRCON_VRR_POSN                                     0x5
#define _VRCON_VRR_POSITION                                 0x5
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x20
#define _VRCON_VREN_POSN                                    0x7
#define _VRCON_VREN_POSITION                                0x7
#define _VRCON_VREN_SIZE                                    0x1
#define _VRCON_VREN_LENGTH                                  0x1
#define _VRCON_VREN_MASK                                    0x80
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8

// Register: EEDAT
#define EEDAT EEDAT
extern volatile unsigned char           EEDAT               __at(0x09A);
#ifndef _LIB_BUILD
asm("EEDAT equ 09Ah");
#endif
// aliases
extern volatile unsigned char           EEDATA              __at(0x09A);
#ifndef _LIB_BUILD
asm("EEDATA equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDAT                  :8;
    };
} EEDATbits_t;
extern volatile EEDATbits_t EEDATbits __at(0x09A);
// bitfield macros
#define _EEDAT_EEDAT_POSN                                   0x0
#define _EEDAT_EEDAT_POSITION                               0x0
#define _EEDAT_EEDAT_SIZE                                   0x8
#define _EEDAT_EEDAT_LENGTH                                 0x8
#define _EEDAT_EEDAT_MASK                                   0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned EEDAT                  :8;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0x09A);
// bitfield macros
#define _EEDATA_EEDAT_POSN                                  0x0
#define _EEDATA_EEDAT_POSITION                              0x0
#define _EEDATA_EEDAT_SIZE                                  0x8
#define _EEDATA_EEDAT_LENGTH                                0x8
#define _EEDATA_EEDAT_MASK                                  0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0x09B);
#ifndef _LIB_BUILD
asm("EEADR equ 09Bh");
#endif

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0x09C);
#ifndef _LIB_BUILD
asm("EECON1 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x09C);
// bitfield macros
#define _EECON1_RD_POSN                                     0x0
#define _EECON1_RD_POSITION                                 0x0
#define _EECON1_RD_SIZE                                     0x1
#define _EECON1_RD_LENGTH                                   0x1
#define _EECON1_RD_MASK                                     0x1
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0x09D);
#ifndef _LIB_BUILD
asm("EECON2 equ 09Dh");
#endif

// Register: CRCON
#define CRCON CRCON
extern volatile unsigned char           CRCON               __at(0x110);
#ifndef _LIB_BUILD
asm("CRCON equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRREG                  :2;
        unsigned                        :4;
        unsigned ENC_nDEC               :1;
        unsigned GO_nDONE               :1;
    };
    struct {
        unsigned CRREG0                 :1;
        unsigned CRREG1                 :1;
        unsigned                        :4;
        unsigned ENC_DEC                :1;
        unsigned GO                     :1;
    };
} CRCONbits_t;
