MikroElektronika/core_packages/PIC/XC8/def/PIC12F635/mcu.h
extern volatile CRCONbits_t CRCONbits __at(0x110);
// bitfield macros
#define _CRCON_CRREG_POSN                                   0x0
#define _CRCON_CRREG_POSITION                               0x0
#define _CRCON_CRREG_SIZE                                   0x2
#define _CRCON_CRREG_LENGTH                                 0x2
#define _CRCON_CRREG_MASK                                   0x3
#define _CRCON_ENC_nDEC_POSN                                0x6
#define _CRCON_ENC_nDEC_POSITION                            0x6
#define _CRCON_ENC_nDEC_SIZE                                0x1
#define _CRCON_ENC_nDEC_LENGTH                              0x1
#define _CRCON_ENC_nDEC_MASK                                0x40
#define _CRCON_GO_nDONE_POSN                                0x7
#define _CRCON_GO_nDONE_POSITION                            0x7
#define _CRCON_GO_nDONE_SIZE                                0x1
#define _CRCON_GO_nDONE_LENGTH                              0x1
#define _CRCON_GO_nDONE_MASK                                0x80
#define _CRCON_CRREG0_POSN                                  0x0
#define _CRCON_CRREG0_POSITION                              0x0
#define _CRCON_CRREG0_SIZE                                  0x1
#define _CRCON_CRREG0_LENGTH                                0x1
#define _CRCON_CRREG0_MASK                                  0x1
#define _CRCON_CRREG1_POSN                                  0x1
#define _CRCON_CRREG1_POSITION                              0x1
#define _CRCON_CRREG1_SIZE                                  0x1
#define _CRCON_CRREG1_LENGTH                                0x1
#define _CRCON_CRREG1_MASK                                  0x2
#define _CRCON_ENC_DEC_POSN                                 0x6
#define _CRCON_ENC_DEC_POSITION                             0x6
#define _CRCON_ENC_DEC_SIZE                                 0x1
#define _CRCON_ENC_DEC_LENGTH                               0x1
#define _CRCON_ENC_DEC_MASK                                 0x40
#define _CRCON_GO_POSN                                      0x7
#define _CRCON_GO_POSITION                                  0x7
#define _CRCON_GO_SIZE                                      0x1
#define _CRCON_GO_LENGTH                                    0x1
#define _CRCON_GO_MASK                                      0x80

// Register: CRDAT0
#define CRDAT0 CRDAT0
extern volatile unsigned char           CRDAT0              __at(0x111);
#ifndef _LIB_BUILD
asm("CRDAT0 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRDAT0                 :8;
    };
} CRDAT0bits_t;
extern volatile CRDAT0bits_t CRDAT0bits __at(0x111);
// bitfield macros
#define _CRDAT0_CRDAT0_POSN                                 0x0
#define _CRDAT0_CRDAT0_POSITION                             0x0
#define _CRDAT0_CRDAT0_SIZE                                 0x8
#define _CRDAT0_CRDAT0_LENGTH                               0x8
#define _CRDAT0_CRDAT0_MASK                                 0xFF

// Register: CRDAT1
#define CRDAT1 CRDAT1
extern volatile unsigned char           CRDAT1              __at(0x112);
#ifndef _LIB_BUILD
asm("CRDAT1 equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRDAT1                 :8;
    };
} CRDAT1bits_t;
extern volatile CRDAT1bits_t CRDAT1bits __at(0x112);
// bitfield macros
#define _CRDAT1_CRDAT1_POSN                                 0x0
#define _CRDAT1_CRDAT1_POSITION                             0x0
#define _CRDAT1_CRDAT1_SIZE                                 0x8
#define _CRDAT1_CRDAT1_LENGTH                               0x8
#define _CRDAT1_CRDAT1_MASK                                 0xFF

// Register: CRDAT2
#define CRDAT2 CRDAT2
extern volatile unsigned char           CRDAT2              __at(0x113);
#ifndef _LIB_BUILD
asm("CRDAT2 equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRDAT2                 :8;
    };
} CRDAT2bits_t;
extern volatile CRDAT2bits_t CRDAT2bits __at(0x113);
// bitfield macros
#define _CRDAT2_CRDAT2_POSN                                 0x0
#define _CRDAT2_CRDAT2_POSITION                             0x0
#define _CRDAT2_CRDAT2_SIZE                                 0x8
#define _CRDAT2_CRDAT2_LENGTH                               0x8
#define _CRDAT2_CRDAT2_MASK                                 0xFF

// Register: CRDAT3
#define CRDAT3 CRDAT3
extern volatile unsigned char           CRDAT3              __at(0x114);
#ifndef _LIB_BUILD
asm("CRDAT3 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRDAT3                 :8;
    };
} CRDAT3bits_t;
extern volatile CRDAT3bits_t CRDAT3bits __at(0x114);
// bitfield macros
#define _CRDAT3_CRDAT3_POSN                                 0x0
#define _CRDAT3_CRDAT3_POSITION                             0x0
#define _CRDAT3_CRDAT3_SIZE                                 0x8
#define _CRDAT3_CRDAT3_LENGTH                               0x8
#define _CRDAT3_CRDAT3_MASK                                 0xFF

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,3)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x63);	// @ (0xC * 8 + 3)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,3)
// CMCON0<C1INV>
extern volatile __bit                   C1INV               __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 C1INV_bit           _BIT_ACCESS(CMCON0,4)
// CMCON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON0,6)
// CMCON1<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CMCON1,0)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CMCON0<CINV>
extern volatile __bit                   CINV                __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 CINV_bit            _BIT_ACCESS(CMCON0,4)
// CMCON0<CIS>
extern volatile __bit                   CIS                 __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 CIS_bit             _BIT_ACCESS(CMCON0,3)
// CMCON0<CM0>
extern volatile __bit                   CM0                 __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 CM0_bit             _BIT_ACCESS(CMCON0,0)
// CMCON0<CM1>
extern volatile __bit                   CM1                 __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 CM1_bit             _BIT_ACCESS(CMCON0,1)
// CMCON0<CM2>
extern volatile __bit                   CM2                 __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 CM2_bit             _BIT_ACCESS(CMCON0,2)
// CMCON1<CMSYNC>
extern volatile __bit                   CMSYNC              __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 CMSYNC_bit          _BIT_ACCESS(CMCON1,0)
// CMCON0<COUT>
extern volatile __bit                   COUT                __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 COUT_bit            _BIT_ACCESS(CMCON0,6)
// PIE1<CRIE>
extern volatile __bit                   CRIE                __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 CRIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<CRIF>
extern volatile __bit                   CRIF                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 CRIF_bit            _BIT_ACCESS(PIR1,5)
// CRCON<CRREG0>
extern volatile __bit                   CRREG0              __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 CRREG0_bit          _BIT_ACCESS(CRCON,0)
// CRCON<CRREG1>
extern volatile __bit                   CRREG1              __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 CRREG1_bit          _BIT_ACCESS(CRCON,1)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// PIE1<EEIE>
extern volatile __bit                   EEIE                __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 EEIE_bit            _BIT_ACCESS(PIE1,7)
// PIR1<EEIF>
extern volatile __bit                   EEIF                __at(0x67);	// @ (0xC * 8 + 7)
#define                                 EEIF_bit            _BIT_ACCESS(PIR1,7)
// CRCON<ENC_DEC>
extern volatile __bit                   ENC_DEC             __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 ENC_DEC_bit         _BIT_ACCESS(CRCON,6)
// CRCON<ENC_nDEC>
extern volatile __bit                   ENC_nDEC            __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 ENC_nDEC_bit        _BIT_ACCESS(CRCON,6)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// CRCON<GO>
extern volatile __bit                   GO                  __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 GO_bit              _BIT_ACCESS(CRCON,7)
// CRCON<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 GO_nDONE_bit        _BIT_ACCESS(CRCON,7)
// GPIO<GP0>
extern volatile __bit                   GP0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 GP0_bit             _BIT_ACCESS(GPIO,0)
// GPIO<GP1>
extern volatile __bit                   GP1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 GP1_bit             _BIT_ACCESS(GPIO,1)
// GPIO<GP2>
extern volatile __bit                   GP2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 GP2_bit             _BIT_ACCESS(GPIO,2)
// GPIO<GP3>
extern volatile __bit                   GP3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 GP3_bit             _BIT_ACCESS(GPIO,3)
// GPIO<GP4>
extern volatile __bit                   GP4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 GP4_bit             _BIT_ACCESS(GPIO,4)
// GPIO<GP5>
extern volatile __bit                   GP5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 GP5_bit             _BIT_ACCESS(GPIO,5)
// OSCCON<HTS>
extern volatile __bit                   HTS                 __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 HTS_bit             _BIT_ACCESS(OSCCON,2)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCA<IOCA0>
extern volatile __bit                   IOCA0               __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOCA0_bit           _BIT_ACCESS(IOCA,0)
// IOCA<IOCA1>
extern volatile __bit                   IOCA1               __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOCA1_bit           _BIT_ACCESS(IOCA,1)
// IOCA<IOCA2>
extern volatile __bit                   IOCA2               __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOCA2_bit           _BIT_ACCESS(IOCA,2)
// IOCA<IOCA3>
extern volatile __bit                   IOCA3               __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOCA3_bit           _BIT_ACCESS(IOCA,3)
// IOCA<IOCA4>
extern volatile __bit                   IOCA4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCA4_bit           _BIT_ACCESS(IOCA,4)
// IOCA<IOCA5>
extern volatile __bit                   IOCA5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCA5_bit           _BIT_ACCESS(IOCA,5)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// LVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(LVDCON,5)
// OSCCON<LTS>
extern volatile __bit                   LTS                 __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 LTS_bit             _BIT_ACCESS(OSCCON,1)
// LVDCON<LVDEN>
extern volatile __bit                   LVDEN               __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 LVDEN_bit           _BIT_ACCESS(LVDCON,4)
// PIE1<LVDIE>
extern volatile __bit                   LVDIE               __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE1,6)
// PIR1<LVDIF>
extern volatile __bit                   LVDIF               __at(0x66);	// @ (0xC * 8 + 6)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR1,6)
// LVDCON<LVDL0>
extern volatile __bit                   LVDL0               __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 LVDL0_bit           _BIT_ACCESS(LVDCON,0)
// LVDCON<LVDL1>
extern volatile __bit                   LVDL1               __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 LVDL1_bit           _BIT_ACCESS(LVDCON,1)
// LVDCON<LVDL2>
extern volatile __bit                   LVDL2               __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 LVDL2_bit           _BIT_ACCESS(LVDCON,2)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x62);	// @ (0xC * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,2)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// LVDCON<PLVDEN>
extern volatile __bit                   PLVDEN              __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 PLVDEN_bit          _BIT_ACCESS(LVDCON,4)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x408);	// @ (0x81 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x409);	// @ (0x81 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// GPIO<RA0>
extern volatile __bit                   RA0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(GPIO,0)
// GPIO<RA1>
extern volatile __bit                   RA1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(GPIO,1)
// GPIO<RA2>
extern volatile __bit                   RA2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(GPIO,2)
// GPIO<RA3>
extern volatile __bit                   RA3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(GPIO,3)
// GPIO<RA4>
extern volatile __bit                   RA4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(GPIO,4)
// GPIO<RA5>
extern volatile __bit                   RA5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(GPIO,5)
// INTCON<RAIE>
extern volatile __bit                   RAIE                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 RAIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RAIF>
extern volatile __bit                   RAIF                __at(0x58);	// @ (0xB * 8 + 0)
#define                                 RAIF_bit            _BIT_ACCESS(INTCON,0)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// STATUS<RP0>
extern volatile __bit                   RP0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 RP0_bit             _BIT_ACCESS(STATUS,5)
// STATUS<RP1>
extern volatile __bit                   RP1                 __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 RP1_bit             _BIT_ACCESS(STATUS,6)
// PCON<SBODEN>
extern volatile __bit                   SBODEN              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 SBODEN_bit          _BIT_ACCESS(PCON,4)
// PCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 SBOREN_bit          _BIT_ACCESS(PCON,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x40D);	// @ (0x81 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x40C);	// @ (0x81 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1CON<T1GINV>
extern volatile __bit                   T1GINV              __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 T1GINV_bit          _BIT_ACCESS(T1CON,7)
// CMCON1<T1GSS>
extern volatile __bit                   T1GSS               __at(0xD1);	// @ (0x1A * 8 + 1)
#define                                 T1GSS_bit           _BIT_ACCESS(CMCON1,1)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// T1CON<TMR1CS>
extern volatile __bit                   TMR1CS              __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 TMR1CS_bit          _BIT_ACCESS(T1CON,1)
// T1CON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1CON,6)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x60);	// @ (0xC * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// TRISIO<TRISA0>
extern volatile __bit                   TRISA0              __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISIO,0)
// TRISIO<TRISA1>
extern volatile __bit                   TRISA1              __at(0x429);	// @ (0x85 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISIO,1)
// TRISIO<TRISA2>
extern volatile __bit                   TRISA2              __at(0x42A);	// @ (0x85 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISIO,2)
// TRISIO<TRISA3>
extern volatile __bit                   TRISA3              __at(0x42B);	// @ (0x85 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISIO,3)
// TRISIO<TRISA4>
extern volatile __bit                   TRISA4              __at(0x42C);	// @ (0x85 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISIO,4)
// TRISIO<TRISA5>
extern volatile __bit                   TRISA5              __at(0x42D);	// @ (0x85 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISIO,5)
// TRISIO<TRISIO0>
extern volatile __bit                   TRISIO0             __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 TRISIO0_bit         _BIT_ACCESS(TRISIO,0)
